src/InformationRegisters/СостояниеПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостояниеПриложения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ОбъектыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОбъектыНедвижимости</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/Дома/Ext/Module.bsl
// Сервис домов и мест (ARCHITECTURE §4, модуль Home): дом по умолчанию,
// архивирование вместо удаления, контроль дерева мест внутри одного дома.
// Тексты, видимые пользователю, — только по словарю (docs/GLOSSARY.md).

#Область ПрограммныйИнтерфейс

// Возвращает дом по умолчанию для новых записей:
//  1) дом, выбранный последним (ключ «ПоследнийДом»), если он ещё активен;
//  2) иначе первый активный дом по наименованию (единственный активный дом — он же).
//
// Возвращаемое значение:
//  СправочникСсылка.ОбъектыНедвижимости - пустая ссылка, если активных домов нет.
//
Функция ДомПоУмолчанию() Экспорт

	Дом = ПоследнийДом();
	Если Дом.Пустая() Тогда
		Дом = ПервыйАктивныйДом();
	КонецЕсли;
	Возврат Дом;

КонецФункции

// Возвращает количество домов.
//
// Параметры:
//  ВключаяАрхив - Булево - учитывать дома из архива.
//
// Возвращаемое значение:
//  Число
//
Функция КоличествоДомов(Знач ВключаяАрхив = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
	|ГДЕ
	|	НЕ ОбъектыНедвижимости.ПометкаУдаления";
	Если НЕ ВключаяАрхив Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ ОбъектыНедвижимости.Архив";
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	Возврат 0;

КонецФункции

// Запоминает дом как выбранный последним (ключ «ПоследнийДом»).
//
// Параметры:
//  Дом - СправочникСсылка.ОбъектыНедвижимости
//
Процедура ЗапомнитьПоследнийДом(Дом) Экспорт

	Если Дом.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Запись = РегистрыСведений.СостояниеПриложения.СоздатьМенеджерЗаписи();
	Запись.Ключ = КлючПоследнегоДома();
	Запись.Значение = Строка(Дом.УникальныйИдентификатор());
	Запись.Записать(Истина);

КонецПроцедуры

// Переносит дом или место в архив (и обратно) вместе со всеми вложенными местами:
// у дома — все его места, у места — всё поддерево. Сервис меняет признак только
// у самого объекта, а по дереву его распространяют события ПриЗаписи объектов,
// поэтому архив из карточки ведёт себя так же. Одна транзакция,
// управляемая блокировка (std648).
//
// Параметры:
//  Ссылка - СправочникСсылка.ОбъектыНедвижимости, СправочникСсылка.МестаХранения
//  Архив  - Булево
//
Процедура УстановитьАрхив(Ссылка, Архив) Экспорт

	ЭтоДом = ТипЗнч(Ссылка) = Тип("СправочникСсылка.ОбъектыНедвижимости");
	ЭтоМесто = ТипЗнч(Ссылка) = Тип("СправочникСсылка.МестаХранения");
	Если (НЕ ЭтоДом И НЕ ЭтоМесто) ИЛИ Ссылка.Пустая() Тогда
		ВызватьИсключение НСтр("ru = 'Архив можно включить и выключить только у дома или места.'");
	КонецЕсли;

	Если ЭтоДом Тогда
		Дом = Ссылка;
	Иначе
		Сведения = СведенияОМесте(Ссылка);
		Если Сведения = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Это место уже не существует. Обновите список и попробуйте ещё раз.'");
		КонецЕсли;
		Дом = Сведения.Владелец;
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		ЗаблокироватьДомИМеста(Дом);

		// Вложенные места записывают события ПриЗаписи этого объекта.
		ЗаписатьАрхив(Ссылка, Архив);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Если Архив Тогда
			Текст = НСтр("ru = 'Не удалось перенести в архив. Попробуйте ещё раз.'");
		Иначе
			Текст = НСтр("ru = 'Не удалось вернуть из архива. Попробуйте ещё раз.'");
		КонецЕсли;
		// Журнала регистрации на мобильном приложении нет: исходная ошибка уходит причиной исключения.
		ВызватьИсключение(Текст, , , , ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

// Сравнивает признак «Архив» со значением, сохранённым в базе по ссылке.
// У нового (ещё не записанного) объекта признак считается неизменившимся.
//
// Параметры:
//  Ссылка - СправочникСсылка.ОбъектыНедвижимости, СправочникСсылка.МестаХранения
//  Архив  - Булево
//
// Возвращаемое значение:
//  Булево
//
Функция ИзменилсяАрхив(Ссылка, Архив) Экспорт

	Запрос = Новый Запрос;
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ОбъектыНедвижимости") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОбъектыНедвижимости.Архив КАК Архив
		|ИЗ
		|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
		|ГДЕ
		|	ОбъектыНедвижимости.Ссылка = &Ссылка";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МестаХранения.Архив КАК Архив
		|ИЗ
		|	Справочник.МестаХранения КАК МестаХранения
		|ГДЕ
		|	МестаХранения.Ссылка = &Ссылка";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Выборка.Архив <> Архив;

КонецФункции

// Записывает признак «Архив» местам дома без родителя.
// Дальше по дереву значение распространяют события записываемых мест.
//
// Параметры:
//  Дом   - СправочникСсылка.ОбъектыНедвижимости
//  Архив - Булево
//
Процедура ЗаписатьАрхивМестамДома(Дом, Архив) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.МестаХранения КАК МестаХранения
	|ГДЕ
	|	МестаХранения.Владелец = &Владелец
	|	И МестаХранения.Родитель = ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Владелец", Дом);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписатьАрхив(Выборка.Ссылка, Архив);
	КонецЦикла;

КонецПроцедуры

// Записывает признак «Архив» непосредственным вложенным местам.
// Дальше по дереву значение распространяют события записываемых мест.
//
// Параметры:
//  Место - СправочникСсылка.МестаХранения
//  Архив - Булево
//
Процедура ЗаписатьАрхивВложеннымМестам(Место, Архив) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестаХранения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.МестаХранения КАК МестаХранения
	|ГДЕ
	|	МестаХранения.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель", Место);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписатьАрхив(Выборка.Ссылка, Архив);
	КонецЦикла;

КонецПроцедуры

// Проверяет место перед записью: родитель принадлежит тому же дому,
// смена дома не отрывает вложенные места, место не входит в само себя
// и в свои вложенные места (нет циклов).
// При нарушении добавляет сообщение по словарю и устанавливает Отказ.
//
// Параметры:
//  МестоОбъект - СправочникОбъект.МестаХранения
//  Отказ       - Булево
//
Процедура ПроверитьМесто(МестоОбъект, Отказ) Экспорт

	// У нового места «Ссылка» ещё пустая: сравнение с родителем имеет смысл
	// только при заполненном родителе.
	Если НЕ МестоОбъект.Родитель.Пустая() И МестоОбъект.Родитель = МестоОбъект.Ссылка Тогда
		Отказ = Истина;
		СообщитьПользователю(НСтр("ru = 'Место не может входить в само себя. Выберите другое место или оставьте поле пустым.'"),
			"Родитель");
		Возврат;
	КонецЕсли;

	Если ПереноситсяВДругойДомСДетьми(МестоОбъект) Тогда
		Отказ = Истина;
		СообщитьПользователю(НСтр("ru = 'У этого места есть вложенные места. Перенесите их вместе с ним или сначала разберите.'"),
			"Владелец");
		Возврат;
	КонецЕсли;

	Если МестоОбъект.Родитель.Пустая() Тогда
		Возврат;
	КонецЕсли;

	СведенияРодителя = СведенияОМесте(МестоОбъект.Родитель);
	Если СведенияРодителя <> Неопределено И СведенияРодителя.Владелец <> МестоОбъект.Владелец Тогда
		Отказ = Истина;
		СообщитьПользователю(СтрШаблон(НСтр("ru = 'Место «%1» относится к другому дому. Выберите место из того же дома.'"),
			Строка(МестоОбъект.Родитель)), "Родитель");
		Возврат;
	КонецЕсли;

	Если МестоОбразуетЦикл(МестоОбъект.Ссылка, МестоОбъект.Родитель) Тогда
		Отказ = Истина;
		СообщитьПользователю(НСтр("ru = 'Место не может входить в свои вложенные места. Выберите место выше по дереву или оставьте поле пустым.'"),
			"Родитель");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Дом, выбранный последним, если он существует и не в архиве.
Функция ПоследнийДом()

	Идентификатор = Миграции.ЗначениеСостояния(КлючПоследнегоДома());
	Если ПустаяСтрока(Идентификатор) Тогда
		Возврат Справочники.ОбъектыНедвижимости.ПустаяСсылка();
	КонецЕсли;

	Попытка
		Дом = Справочники.ОбъектыНедвижимости.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	Исключение
		// Повреждённое значение (например, после восстановления копии): считаем, что выбора не было.
		Возврат Справочники.ОбъектыНедвижимости.ПустаяСсылка();
	КонецПопытки;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбъектыНедвижимости.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
	|ГДЕ
	|	ОбъектыНедвижимости.Ссылка = &Ссылка
	|	И НЕ ОбъектыНедвижимости.ПометкаУдаления
	|	И НЕ ОбъектыНедвижимости.Архив";
	Запрос.УстановитьПараметр("Ссылка", Дом);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.ОбъектыНедвижимости.ПустаяСсылка();

КонецФункции

// Первый активный дом по наименованию.
Функция ПервыйАктивныйДом()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбъектыНедвижимости.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
	|ГДЕ
	|	НЕ ОбъектыНедвижимости.ПометкаУдаления
	|	И НЕ ОбъектыНедвижимости.Архив
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектыНедвижимости.Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.ОбъектыНедвижимости.ПустаяСсылка();

КонецФункции

// Возвращает родителя и дом места; Неопределено, если места нет.
Функция СведенияОМесте(Место)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестаХранения.Родитель КАК Родитель,
	|	МестаХранения.Владелец КАК Владелец
	|ИЗ
	|	Справочник.МестаХранения КАК МестаХранения
	|ГДЕ
	|	МестаХранения.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Место);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Родитель, Владелец", Выборка.Родитель, Выборка.Владелец);
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Меняет ли существующее место дом, оставляя вложенные места в старом.
Функция ПереноситсяВДругойДомСДетьми(МестоОбъект)

	Если МестоОбъект.Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	Сведения = СведенияОМесте(МестоОбъект.Ссылка);
	Возврат Сведения <> Неопределено
		И Сведения.Владелец <> МестоОбъект.Владелец
		И ЕстьВложенныеМеста(МестоОбъект.Ссылка);

КонецФункции

// Есть ли у места вложенные места, включая помеченные на удаление.
Функция ЕстьВложенныеМеста(Место)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.МестаХранения КАК МестаХранения
	|ГДЕ
	|	МестаХранения.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель", Место);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий() И Выборка.Количество > 0;

КонецФункции

// Проверяет, встретится ли записываемое место при подъёме от родителя вверх по дереву.
Функция МестоОбразуетЦикл(Ссылка, Родитель)

	Пройденные = Новый Соответствие;
	ТекущийРодитель = Родитель;
	Пока НЕ ТекущийРодитель.Пустая() Цикл
		Если ТекущийРодитель = Ссылка Тогда
			Возврат Истина;
		КонецЕсли;
		Если Пройденные[ТекущийРодитель] <> Неопределено Тогда
			// Уже существующий в данных цикл, не связанный с записываемым местом.
			Возврат Ложь;
		КонецЕсли;
		Пройденные.Вставить(ТекущийРодитель, Истина);
		Сведения = СведенияОМесте(ТекущийРодитель);
		Если Сведения = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		ТекущийРодитель = Сведения.Родитель;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

// Исключительная блокировка дома и всех мест (std648). У подчинённого справочника
// мест нет поля «Владелец» в пространстве блокировок, поэтому места блокируются
// целиком: приложением пользуется один человек, объём данных — бытовой.
Процедура ЗаблокироватьДомИМеста(Дом)

	Блокировка = Новый БлокировкаДанных;
	ЭлементДома = Блокировка.Добавить("Справочник.ОбъектыНедвижимости");
	ЭлементДома.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементДома.УстановитьЗначение("Ссылка", Дом);
	ЭлементМест = Блокировка.Добавить("Справочник.МестаХранения");
	ЭлементМест.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();

КонецПроцедуры

// Записывает признак архива у дома или места, если он изменился.
// Дальше по дереву значение распространяют события записываемого объекта.
Процедура ЗаписатьАрхив(Ссылка, Архив)

	Объект = Ссылка.ПолучитьОбъект();
	Если Объект = Неопределено ИЛИ Объект.Архив = Архив Тогда
		Возврат;
	КонецЕсли;
	Объект.Архив = Архив;
	Объект.Записать();

КонецПроцедуры

Процедура СообщитьПользователю(Текст, Поле = "")

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	Сообщение.Сообщить();

КонецПроцедуры

Функция КлючПоследнегоДома()

	Возврат "ПоследнийДом";

КонецФункции

#КонецОбласти
